# Name Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilySizeTableColumn..::..Name Property
FamilySizeTableColumn Class See Also
---
The column name.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public string Name { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Name As String
	Get
```

Visual C++
---
```text
public:
property String^ Name {
	String^ get ();
}
```

# See Also
FamilySizeTableColumn Class
Autodesk.Revit.DB Namespace